use crate::text::SymbolSet;

pub const SMJ_EXPANDED: SymbolSet = SymbolSet::new(&[
    "!", "'", "\"", ",", ".", ":", ";", "?", "-", " ", "A", "Á", "Æ", "Å", "Ä", "B", "C", "D", "E",
    "F", "G", "H", "I", "J", "K", "L", "M", "N", "Ŋ", "Ń", "Ñ", "O", "Ø", "Ö", "P", "Q", "R", "S",
    "T", "Ŧ", "U", "V", "W", "X", "Y", "Z", "a", "á", "æ", "å", "ä", "b", "c", "d", "e", "f", "g",
    "h", "i", "j", "k", "l", "m", "n", "ŋ", "ń", "ñ", "o", "ø", "ö", "p", "q", "r", "s", "t", "u",
    "v", "w", "x", "y", "z",
]);

pub const SME_EXPANDED: SymbolSet = SymbolSet::new(&[
    "!", "'", "\"", ",", ".", ":", ";", "?", "-", " ", "A", "Á", "Æ", "Å", "Ä", "B", "C", "Č", "D",
    "Đ", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "Ŋ", "O", "Ø", "Ö", "P", "Q", "R", "S",
    "Š", "T", "Ŧ", "U", "V", "W", "X", "Y", "Z", "Ž", "a", "á", "æ", "å", "ä", "b", "c", "č", "d",
    "đ", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "ŋ", "o", "ø", "ö", "p", "q", "r", "s",
    "š", "t", "ŧ", "u", "v", "w", "x", "y", "z", "ž",
]);

pub const SMA_EXPANDED: SymbolSet = SymbolSet::new(&[
    "!", "'", "\"", ",", ".", ":", ";", "?", "-", " ", "A", "Æ", "Å", "B", "C", "D", "E", "F", "G",
    "H", "I", "Ï", "J", "K", "L", "M", "N", "O", "Ø", "Ö", "P", "Q", "R", "S", "T", "U", "V", "W",
    "X", "Y", "Z", "a", "æ", "å", "b", "c", "d", "e", "f", "g", "h", "i", "ï", "j", "k", "l", "m",
    "n", "o", "ø", "ö", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z",
]);

pub const ALL_SAMI: SymbolSet = SymbolSet::new(&[
    "!", "'", "\"", ",", ".", ":", ";", "?", "-", " ", "A", "Á", "Æ", "Å", "Ä", "B", "C", "Č", "D",
    "Đ", "E", "F", "G", "H", "I", "Ï", "J", "K", "L", "M", "N", "Ŋ", "Ń", "Ñ", "O", "Ø", "Ö", "P",
    "Q", "R", "S", "Š", "T", "Ŧ", "U", "V", "W", "X", "Y", "Z", "Ž", "a", "á", "æ", "å", "ä", "b",
    "c", "č", "d", "đ", "e", "f", "g", "h", "i", "ï", "j", "k", "l", "m", "n", "ŋ", "ń", "ñ", "o",
    "ø", "ö", "p", "q", "r", "s", "š", "t", "ŧ", "u", "v", "w", "x", "y", "z", "ž",
]);
